{
  "A1": {
    "title": "Origins — Your Journey Starts Here",
    "text": "Every hero's story begins somewhere. Welcome to Origins, the first stage of your Reading Advantage journey.\n\nThis workbook is designed for learners who are just beginning to read in English. Each article is approximately 250 words—short enough to feel achievable, long enough to build real reading skill. Reading Advantage is built on the principle of extensive reading: learning English naturally by reading a lot at the right level. You do not need to understand every word. Focus on meaning, enjoy the content, and trust that your ability will grow with each page you read.\n\nHow the Workbook and App Work Together\n\nYour teacher will display the Reading Advantage app on the classroom screen and guide you through each lesson step-by-step. You will follow along in your workbook, listening to audio, marking the article, and completing activities. Think of the app as your guide and the workbook as your practice space where you write, collect vocabulary, and build skills.\n\nUnderstanding the Lesson Flow\n\nEach lesson follows 13 steps organized into 4 color-coded phases:\n\n🔵 Phase 1 - Activate (Steps 1-4)\n\nRate your interest in the topic, preview key vocabulary, listen to the article with audio, and collect new words you discover.\n\n🟠 Phase 2 - Engage (Steps 5-7)\n\nRead more carefully, write the main idea of each paragraph, collect useful sentences, and ask language questions (your teacher uses the AI assistant to answer them).\n\n🔴 Phase 3 - Assess (Steps 8-9)\n\nAnswer multiple choice comprehension questions and write a short answer to show your understanding.\n\n🟢 Phase 4 - Practice (Steps 10-13)\n\nPractice vocabulary through matching and fill-in-the-blank exercises, work with sentences, write a longer response, and reflect on what you learned.\n\nEach section shows an estimated time (⏱ 5 min) to help you and your teacher manage the lesson. Most lessons take 90-120 minutes to complete.\n\nMarking as You Read\n\nYour workbook includes a marking legend to help you engage actively with each article:\n\n• ___ (underline) = new word\n\n• ? = something confusing\n\n• ! = interesting fact\n\n• ⭐ = useful sentence you want to practice\n\nDon't worry about understanding everything perfectly. Mark what stands out to you and keep reading.\n\nConnecting with the App\n\nYour journey continues beyond the classroom. After each lesson, complete the homework checklist:\n\n✅ Add your collected vocabulary to the Reading Advantage app (5 min)\n\n✅ Add your collected sentences to the app (5 min)\n\n✅ Complete vocabulary flashcard practice (10 min)\n\n✅ Read the article aloud one more time (5 min)\n\n✅ Optional: Submit your writing for AI feedback\n\nThe app uses spaced repetition to help you remember what you learn. Short, regular practice sessions will help you progress faster.\n\nTips for Success\n\n• Bring your workbook and a pencil to every class\n\n• Participate actively when your teacher leads activities\n\n• Write neatly so you can review your notes later\n\n• Complete all homework before the next lesson\n\n• Check self-assessment boxes honestly to track your own progress\n\nBy the end of Origins, you will be able to understand simple texts on familiar topics, recognize common words, and write basic sentences about yourself and your world. This is the first step—your journey has begun."
  },
  "A2": {
    "title": "Quest — Your Quest Awaits",
    "text": "You have taken your first steps. Now it is time to set out on your quest.\n\nThis workbook is designed for learners who are ready to move beyond the basics and explore a wider range of topics. At the Quest level, you will read longer texts (around 350-400 words) that challenge you while remaining understandable. Extensive reading remains at the heart of your learning. When you read texts at the right level, your brain naturally absorbs new vocabulary and grammar patterns. The goal is steady progress, not perfection.\n\nHow the Workbook and App Work Together\n\nYour teacher will guide the class through the Reading Advantage app displayed at the front of the room. You will follow along in your workbook, participating in discussions, marking the article, and completing written activities. The workbook provides space for note-taking, practice exercises, and writing that complement the digital experience your teacher leads.\n\nUnderstanding the Lesson Flow\n\nEach lesson follows 13 steps organized into 4 color-coded phases:\n\n🔵 Phase 1 - Activate (Steps 1-4)\n\nActivate prior knowledge, preview vocabulary before reading, listen to the article with audio support, and collect new words you encounter.\n\n🟠 Phase 2 - Engage (Steps 5-7)\n\nAnalyze each paragraph's main idea, identify useful sentences for practice, and ask questions about language patterns (your teacher uses the AI assistant for explanations).\n\n🔴 Phase 3 - Assess (Steps 8-9)\n\nDemonstrate comprehension through multiple choice questions and develop a short written response with sentence starters provided.\n\n🟢 Phase 4 - Practice (Steps 10-13)\n\nReinforce vocabulary through matching and context exercises, practice sentence structures, complete an extended writing task, and reflect on your learning.\n\nEach section includes time estimates to help pace the lesson. Complete lessons typically take 90-120 minutes.\n\nMarking as You Read\n\nUse these symbols to engage actively with each article:\n\n• ___ (underline) = new vocabulary\n\n• ? = unclear meaning or structure\n\n• ! = interesting or surprising information\n\n• ⭐ = sentence worth practicing\n\nActive marking helps you process information and creates a record of your thinking.\n\nConnecting with the App\n\nThe Reading Advantage app supports your quest by helping you review vocabulary, practice sentences, and track your progress. After each class, complete the homework checklist:\n\n✅ Transfer collected vocabulary to your digital flashcards (5 min)\n\n✅ Add collected sentences to the app (5 min)\n\n✅ Practice flashcards using spaced repetition (10 min)\n\n✅ Read the article aloud for fluency practice (5 min)\n\n✅ Optional: Submit your writing for AI-powered feedback\n\nConsistent daily practice, even in short sessions, accelerates your progress and retention.\n\nTips for Success\n\n• Come prepared with your workbook and writing materials\n\n• Engage fully during teacher-led activities on the app\n\n• Try to infer word meanings from context before checking definitions\n\n• Complete homework consistently to reinforce what you learned\n\n• Use sentence starters when you need support for writing\n\n• Review previous lessons periodically to see your progress\n\nBy the end of Quest, you will be able to understand the main ideas of texts on familiar topics, follow simple narratives, and communicate comfortably in everyday situations. Your confidence is growing—and the path ahead is opening."
  },
  "B1": {
    "title": "Adventure — Your Adventure's in Sight",
    "text": "You are no longer just learning to read—you are reading to discover.\n\nThe Adventure level is designed for learners who are becoming independent readers. Texts in this workbook range from 500-600 words and explore topics that ask you to think beyond the surface. At this stage, extensive reading becomes especially powerful. As you read more, you begin to acquire vocabulary and grammar naturally through repeated exposure. Each article is chosen to stretch your ability while keeping reading enjoyable.\n\nHow the Workbook and App Work Together\n\nYour teacher uses the Reading Advantage app to lead each lesson on the classroom screen, orchestrating activities that blend whole-class discussion, individual work, and collaborative learning. Your workbook serves as your personal thinking and practice space—a place to annotate articles, develop responses, and build language skills that transfer beyond the classroom.\n\nUnderstanding the Lesson Flow\n\nEach lesson follows 13 steps organized into 4 color-coded phases:\n\n🔵 Phase 1 - Activate (Steps 1-4)\n\nActivate background knowledge and interest, preview and predict with key vocabulary, experience the article through audio-supported reading, and identify unfamiliar vocabulary for further study.\n\n🟠 Phase 2 - Engage (Steps 5-7)\n\nEngage in close reading to extract main ideas from each paragraph, curate useful sentences that demonstrate valuable language patterns, and formulate questions about grammar or vocabulary (answered using the AI assistant).\n\n🔴 Phase 3 - Assess (Steps 8-9)\n\nDemonstrate comprehension through multiple choice questions that test inference and detail, then construct a thoughtful short answer that synthesizes information from the text.\n\n🟢 Phase 4 - Practice (Steps 10-13)\n\nConsolidate vocabulary through contextualized exercises, manipulate sentence structures to internalize patterns, produce extended writing that applies lesson vocabulary and concepts, and reflect on learning outcomes.\n\nTime estimates guide pacing, with complete lessons typically requiring 90-120 minutes of engaged work.\n\nMarking as You Read\n\nDevelop active reading habits using these annotation symbols:\n\n• ___ (underline) = vocabulary worth learning\n\n• ? = confusing structure or unclear reference\n\n• ! = noteworthy fact or compelling idea\n\n• ⭐ = sentence demonstrating useful language patterns\n\nThoughtful annotation deepens comprehension and creates a personalized study resource.\n\nConnecting with the App\n\nThe Reading Advantage app extends learning beyond class time. Your homework routine should include:\n\n✅ Digital transfer of collected vocabulary (5 min)\n\n✅ Adding selected sentences to your practice library (5 min)\n\n✅ Spaced repetition flashcard practice (10 min)\n\n✅ Oral reading for pronunciation and fluency (5 min)\n\n✅ Optional: Digital submission of writing for detailed AI feedback\n\nThe app's algorithms optimize review timing to maximize retention. Re-reading favorite articles can also unlock deeper understanding and reveal language patterns you missed initially.\n\nTips for Success\n\n• Approach each lesson prepared to think critically and participate actively\n\n• Try to infer meaning from context before consulting definitions\n\n• Notice how ideas connect across paragraphs and how arguments develop\n\n• Use writing tasks as opportunities to experiment with new vocabulary\n\n• Organize your collected vocabulary by theme or part of speech\n\n• Review and revise your writing based on AI feedback\n\n• Track patterns in your errors to identify areas for focused improvement\n\nBy the end of Adventure, you will be able to understand the main points of longer texts, handle familiar situations with confidence, and express your ideas clearly in writing. The adventure is real—and you are ready for it."
  },
  "B2": {
    "title": "Hero — You're the Hero in the Story",
    "text": "At this level, you step into a leadership role in your own learning.\n\nHero is designed for upper-intermediate readers who are ready to engage with complex ideas and authentic-style texts. Articles range from 650-1000 words and address topics that require critical thinking and nuanced understanding. Extensive reading at this level accelerates growth. When you read widely and consistently, your vocabulary expands rapidly and your understanding of structure, style, and rhetorical strategies deepens.\n\nHow the Workbook and App Work Together\n\nYour teacher orchestrates lessons using the Reading Advantage app, but at this level, you are expected to take greater initiative—asking probing questions, making connections across texts, and pushing your thinking beyond surface comprehension. The workbook is your intellectual workspace where you analyze arguments, evaluate evidence, develop sophisticated responses, and refine your academic writing skills.\n\nUnderstanding the Lesson Flow\n\nEach lesson follows 13 steps organized into 4 color-coded phases:\n\n🔵 Phase 1 - Activate (Steps 1-4)\n\nActivate relevant schema and evaluate initial interest, engage with sophisticated vocabulary in context, process complex text through audio-supported reading, and strategically select vocabulary that advances your academic or professional goals.\n\n🟠 Phase 2 - Engage (Steps 5-7)\n\nAnalyze paragraph-level argumentation and information structure, identify sentences that exemplify advanced grammar or rhetorical techniques, and generate language questions that explore subtle distinctions in meaning or usage.\n\n🔴 Phase 3 - Assess (Steps 8-9)\n\nDemonstrate comprehension of both explicit content and implicit meaning through multiple choice questions, then produce a well-reasoned short answer that synthesizes information and presents a defensible position.\n\n🟢 Phase 4 - Practice (Steps 10-13)\n\nMaster academic and sophisticated vocabulary through challenging contextualized exercises, analyze and produce complex sentence structures, compose extended writing with clear organization and developed paragraphs, and engage in metacognitive reflection on your learning process.\n\nTime allocations serve as guidelines; invest the time needed to engage deeply with each text and activity.\n\nMarking as You Read\n\nDevelop sophisticated annotation practices:\n\n• ___ (underline) = high-value academic or topical vocabulary\n\n• ? = ambiguous reference, complex structure, or challenging concept\n\n• ! = compelling evidence, unexpected perspective, or significant claim\n\n• ⭐ = sentence demonstrating advanced grammar, effective rhetoric, or precise expression\n\nYour annotations should reflect analytical reading, not just comprehension.\n\nConnecting with the App\n\nUse the Reading Advantage app strategically to optimize your learning:\n\n✅ Curate high-value vocabulary aligned with your goals (5 min)\n\n✅ Build a sentence library targeting specific structures or functions (5 min)\n\n✅ Engage in focused flashcard practice with spaced repetition (10 min)\n\n✅ Practice reading aloud for prosody and confident delivery (5 min)\n\n✅ Optional: Submit writing for AI analysis targeting specific improvement areas\n\nLeverage the AI assistant to explore nuances in word choice, register, collocation, and style. Challenge yourself to summarize or explain texts without referring back, testing your comprehension and retention.\n\nTips for Success\n\n• Approach each text with critical questions: Why was this written? How are ideas supported? What viewpoints are presented or excluded?\n\n• Make connections between this text and others you have read\n\n• Experiment with sophisticated vocabulary in your writing, but prioritize precision over complexity\n\n• Use AI feedback diagnostically—identify patterns in your errors and address them systematically\n\n• Read beyond the workbook: articles, essays, and texts in your areas of interest\n\n• Engage in English outside class: discussions, writing, media consumption\n\n• Set specific, measurable goals for your language development\n\nBy the end of Hero, you will understand complex texts on concrete and abstract topics, interact with confidence in a wide range of situations, and express yourself fluently and precisely in both speech and writing. You are no longer following the story—you are driving it."
  },
  "C1": {
    "title": "Legend — Join the Legion of Learners",
    "text": "Few reach this stage. Welcome to Legend.\n\nThis workbook is designed for advanced readers ready to engage with demanding texts similar to those written for educated native speakers. Articles range from 800-1200 words and explore abstract, academic, and specialized topics. At this level, extensive reading refines intuition. You are not just learning new words—you are developing sensitivity to tone, register, style, implication, and the subtle architecture of sophisticated discourse.\n\nHow the Workbook and App Work Together\n\nYour teacher facilitates lessons using the Reading Advantage app, but you are expected to function as an autonomous learner—generating insights, challenging assumptions, synthesizing across disciplines, and contributing meaningfully to intellectual discourse. The workbook is your analytical laboratory where you deconstruct arguments, evaluate rhetorical choices, craft nuanced responses, and hone precision in academic and professional writing.\n\nUnderstanding the Lesson Flow\n\nEach lesson follows 13 steps organized into 4 color-coded phases:\n\n🔵 Phase 1 - Activate (Steps 1-4)\n\nActivate disciplinary knowledge and critical stance, engage with sophisticated and low-frequency vocabulary in specialized contexts, process dense text through audio support that aids in parsing complex syntax, and curate vocabulary strategically based on academic, professional, or intellectual priorities.\n\n🟠 Phase 2 - Engage (Steps 5-7)\n\nAnalyze how arguments are constructed, evidence is deployed, and rhetorical moves are executed at the paragraph level; identify sentences that demonstrate masterful control of grammar, effective use of hedging or emphasis, or elegant expression; and formulate questions that explore register, collocation, connotation, pragmatic function, or discourse-level phenomena.\n\n🔴 Phase 3 - Assess (Steps 8-9)\n\nDemonstrate sophisticated comprehension of both propositional content and pragmatic meaning through multiple choice questions that test inference, implication, and interpretation; then produce a well-structured short answer that presents a reasoned position supported by textual evidence.\n\n🟢 Phase 4 - Practice (Steps 10-13)\n\nMaster specialized and academic vocabulary with attention to collocation and register, analyze and produce syntactically complex sentences with precision, compose extended writing that exhibits clear reasoning, appropriate register, and rhetorical awareness, and engage in deep metacognitive reflection on learning processes and outcomes.\n\nTime estimates are flexible; prioritize depth of engagement over rigid adherence to scheduling.\n\nMarking as You Read\n\nAnnotate with analytical sophistication:\n\n• ___ (underline) = vocabulary worth mastering for its precision, register appropriateness, or disciplinary relevance\n\n• ? = interpretive ambiguity, complex argumentation requiring careful analysis, or challenging conceptual territory\n\n• ! = particularly effective rhetorical move, compelling evidence, provocative claim, or elegant formulation\n\n• ⭐ = sentence exemplifying syntactic sophistication, effective hedging/boosting, precise lexical choice, or discursive function\n\nYour annotations should reflect engagement with the text as a crafted artifact, not merely as information.\n\nConnecting with the App\n\nLeverage the full platform strategically:\n\n✅ Curate vocabulary with attention to register, collocation, and semantic fields (5 min)\n\n✅ Build a sentence corpus targeting structures, functions, or rhetorical strategies you wish to master (5 min)\n\n✅ Engage in deliberate flashcard practice focusing on distinctions in meaning, usage, and register (10 min)\n\n✅ Practice oral reading for appropriate intonation, stress, and rhetorical delivery (5 min)\n\n✅ Optional: Submit writing for AI analysis with specific feedback requests (e.g., coherence, precision, register consistency)\n\nExplore stylistic questions with the AI: Why this word rather than a synonym? How does sentence structure affect emphasis? What does this hedging accomplish? Revisit earlier texts to observe how your interpretive sophistication has evolved.\n\nTips for Success\n\n• Engage with texts as an equal intellectual participant—evaluate arguments, question assumptions, identify gaps\n\n• Make connections across texts, disciplines, and theoretical frameworks\n\n• In writing, prioritize clarity and precision; complexity should serve meaning, not obscure it\n\n• Use AI feedback to refine stylistic choices and identify subtle errors in register or collocation\n\n• Read extensively beyond the workbook in your areas of professional or intellectual interest\n\n• Write regularly in English for authentic purposes: essays, reports, analyses, correspondence\n\n• Seek opportunities for high-level English use: presentations, debates, professional communication\n\n• Set ambitious goals and track progress toward native-like control of the language\n\nBy the end of Legend, you will understand a wide range of demanding texts, recognize implicit meaning and subtle nuance, and express yourself with precision, fluency, and stylistic appropriateness for academic, professional, and intellectual purposes. You have completed the journey—and earned your place among the legends."
  }
}
