{
  "A1": {
  "title": "Origins — Your Journey Starts Here",
  "text": "Every hero’s story begins somewhere. Welcome to Origins, the first stage of your Reading Advantage journey.\n\nThis workbook is designed for learners who are just beginning to read in English. At this level, you will explore short, simple texts about familiar topics such as family, animals, food, daily routines, and hobbies. The language is carefully controlled, using high-frequency words and clear sentence patterns so you can read with confidence. Each article is approximately 250 words—short enough to feel achievable, long enough to build real reading skill.\n\nReading Advantage is built on the principle of extensive reading: learning English naturally by reading a lot at the right level. You do not need to understand every word. Focus on meaning, enjoy the content, and trust that your ability will grow with each page you read.\n\nHow to Use This Workbook:\nEach lesson follows a consistent structure to support your progress. You will preview key vocabulary, make predictions, and read each article twice—first for general understanding, then more carefully. After reading, you will complete comprehension questions and vocabulary activities that help reinforce what you have read. Your teacher will guide you at every step.\n\nConnecting with the App:\nYour journey continues beyond the classroom with the Reading Advantage app. Record new words in your digital flashcards, listen to article audio, and review vocabulary using spaced repetition. The app tracks your progress and helps you see how far you’ve come.\n\nBy the end of Origins, you will be able to understand simple texts on familiar topics, recognize common words, and write basic sentences about yourself and your world. This is the first step—your journey has begun."
  },
  "A2": {
  "title": "Quest — Your Quest Awaits",
  "text": "You have taken your first steps. Now it is time to set out on your quest.\n\nThis workbook is designed for learners who are ready to move beyond the basics and explore a wider range of topics. At the Quest level, you will read longer texts (around 350–400 words) about travel, history, culture, nature, and interesting people. You will encounter past events, explanations, and descriptions, along with a broader range of everyday expressions and connecting words.\n\nExtensive reading remains at the heart of your learning. When you read texts that are challenging but still understandable, your brain naturally absorbs new vocabulary and grammar patterns. The goal is steady progress, not perfection.\n\nHow to Use This Workbook:\nEach lesson helps you activate what you already know, preview useful vocabulary, and read with a clear purpose. Follow-up activities check understanding, strengthen vocabulary, and guide you toward expressing your own ideas in writing.\n\nConnecting with the App:\nThe Reading Advantage app supports your quest by helping you review vocabulary, practice sentences, and track your XP (experience points). Short, regular practice sessions will help you level up faster and retain what you learn.\n\nBy the end of Quest, you will be able to understand the main ideas of short texts, follow simple narratives, and communicate comfortably in everyday situations. Your confidence is growing—and the path ahead is opening."
  },
  "B1": {
  "title": "Adventure — Your Adventure’s in Sight",
  "text": "You are no longer just learning to read—you are reading to discover.\n\nThe Adventure level is designed for learners who are becoming independent readers. Texts in this workbook range from 500–600 words and explore topics such as science, technology, mysteries, biographies, and global issues. You will encounter richer vocabulary, more complex sentence structures, and texts that ask you to think beyond the surface.\n\nAt this stage, extensive reading becomes especially powerful. As you read more, you begin to acquire vocabulary and grammar naturally through repeated exposure. Each article in this workbook is chosen to stretch your ability while keeping reading enjoyable.\n\nHow to Use This Workbook:\nLessons encourage deeper engagement with texts. Try to infer meaning from context before checking definitions. Notice how ideas connect across paragraphs. Writing tasks ask you to explain opinions, describe experiences, and support your ideas with reasons.\n\nConnecting with the App:\nThe app helps you manage your growing language skills. Use it to review vocabulary, ask questions about language patterns, and monitor your progress. Re-reading favorite articles can unlock deeper understanding.\n\nBy the end of Adventure, you will be able to understand the main points of longer texts, handle familiar situations with confidence, and express your ideas clearly. The adventure is real—and you are ready for it."
  },
  "B2": {
  "title": "Hero — You’re the Hero in the Story",
  "text": "At this level, you step into a leadership role in your own learning.\n\nHero is designed for upper-intermediate readers who are ready to engage with complex ideas and authentic-style texts. Articles range from 650–1000 words and address topics such as science, culture, environmental issues, economics, and contemporary debates. You will encounter implicit meaning, argumentation, and nuanced vocabulary.\n\nExtensive reading at this level accelerates growth. When you read widely and consistently, your vocabulary expands rapidly and your understanding of structure and style deepens.\n\nHow to Use This Workbook:\nApproach each lesson critically. Ask why the author wrote the text, how ideas are supported, and what viewpoints are presented. Writing tasks require clear organization, developed paragraphs, and thoughtful responses.\n\nConnecting with the App:\nUse the Reading Advantage app strategically. Focus on high-value vocabulary, use AI feedback to refine your writing, and challenge yourself to summarize or explain texts without looking back.\n\nBy the end of Hero, you will understand complex texts, interact with confidence, and express yourself fluently in speech and writing. You are no longer following the story—you are driving it."
  },
  "C1": {
  "title": "Legend — Join the Legion of Learners",
  "text": "Few reach this stage. Welcome to Legend.\n\nThis workbook is designed for advanced readers ready to engage with demanding texts similar to those written for educated native speakers. Articles range from 800–1200 words and explore abstract, academic, and specialized topics. You will encounter subtle distinctions in meaning, advanced argumentation, and sophisticated vocabulary.\n\nAt this level, extensive reading refines intuition. You are not just learning new words—you are developing sensitivity to tone, register, style, and nuance.\n\nHow to Use This Workbook:\nEngage with texts as an equal participant. Evaluate arguments, question assumptions, and connect ideas across disciplines. Writing tasks require well-structured, extended responses with precise language and clear reasoning.\n\nConnecting with the App:\nLeverage the full platform: explore stylistic questions with the AI, refine your writing toward greater sophistication, and organize vocabulary by theme or register. Revisit earlier texts to see how your perception has evolved.\n\nBy the end of Legend, you will understand a wide range of complex texts and express yourself with precision and confidence for academic, professional, and intellectual purposes. You have completed the journey—and earned your place among the legends."
  }
}
