{
  "A1": {
    "title": "Origins - การเดินทางของคุณเริ่มต้นที่นี่",
    "text": "เรื่องราวของฮีโร่ทุกคนมีจุดเริ่มต้นเสมอ ยินดีต้อนรับสู่ Origins ขั้นแรกของการเดินทาง Reading Advantage ของคุณ.\n\nแบบฝึกหัดเล่มนี้ออกแบบมาสำหรับผู้เรียนที่เพิ่งเริ่มต้นอ่านภาษาอังกฤษ ในระดับนี้คุณจะสำรวจบทความสั้น ๆ เข้าใจง่ายเกี่ยวกับหัวข้อที่คุ้นเคย เช่น ครอบครัว สัตว์ อาหาร กิจวัตรประจำวัน และงานอดิเรก ภาษาได้รับการควบคุมอย่างพิถีพิถัน ใช้คำที่พบบ่อยและรูปประโยคที่ชัดเจนเพื่อให้คุณอ่านได้อย่างมั่นใจ แต่ละบทความยาวประมาณ 250 คำ สั้นพอให้รู้สึกทำได้ ยาวพอที่จะสร้างทักษะการอ่านจริง.\n\nReading Advantage สร้างขึ้นบนหลักการอ่านอย่างกว้างขวาง: เรียนภาษาอังกฤษอย่างเป็นธรรมชาติด้วยการอ่านจำนวนมากในระดับที่เหมาะสม คุณไม่จำเป็นต้องเข้าใจทุกคำ ให้โฟกัสที่ความหมาย เพลิดเพลินกับเนื้อหา แล้วเชื่อว่าความสามารถของคุณจะเติบโตกับทุกหน้าที่อ่าน.\n\nวิธีใช้แบบฝึกหัดเล่มนี้:\nแต่ละบทเรียนมีโครงสร้างสม่ำเสมอเพื่อคอยสนับสนุนความก้าวหน้าของคุณ คุณจะได้ทบทวนคำศัพท์สำคัญ คาดเดาเรื่องราว และอ่านบทความสองรอบ รอบแรกเพื่อความเข้าใจภาพรวม แล้วอ่านอย่างละเอียดอีกครั้ง หลังอ่านจบคุณจะทำคำถามความเข้าใจและกิจกรรมคำศัพท์เพื่อย้ำสิ่งที่เรียน ครูของคุณจะคอยแนะนำทุกขั้นตอน.\n\nเชื่อมต่อกับแอป:\nการเดินทางของคุณยังดำเนินต่อไปนอกห้องเรียนด้วยแอป Reading Advantage บันทึกคำใหม่ในแฟลชการ์ดดิจิทัล ฟังเสียงบทความ และทบทวนคำศัพท์ด้วย spaced repetition แอปติดตามความก้าวหน้าและช่วยให้คุณเห็นว่ามาไกลแค่ไหน.\n\nเมื่อจบ Origins คุณจะอ่านเข้าใจบทความง่าย ๆ บนหัวข้อคุ้นเคย รู้จักคำที่ใช้บ่อย และเขียนประโยคพื้นฐานเกี่ยวกับตัวคุณและโลกของคุณได้ นี่คือก้าวแรก การเดินทางได้เริ่มแล้ว."
  },
  "A2": {
    "title": "Quest - ภารกิจของคุณกำลังรออยู่",
    "text": "คุณได้ก้าวแรกเรียบร้อย ถึงเวลามุ่งหน้าสู่ภารกิจของคุณ.\n\nแบบฝึกเล่มนี้ออกแบบมาสำหรับผู้เรียนที่พร้อมก้าวพ้นพื้นฐานและสำรวจหัวข้อที่กว้างขึ้น ในระดับ Quest คุณจะอ่านบทความยาวขึ้น (ประมาณ 350-400 คำ) เกี่ยวกับการท่องเที่ยว ประวัติศาสตร์ วัฒนธรรม ธรรมชาติ และผู้คนที่น่าสนใจ คุณจะพบเหตุการณ์ในอดีต คำอธิบาย และการบรรยาย พร้อมคำศัพท์และคำเชื่อมในชีวิตประจำวันหลากหลายขึ้น.\n\nการอ่านอย่างกว้างขวางยังคงเป็นหัวใจของการเรียนรู้ เมื่อคุณอ่านบทความที่ท้าทายแต่ยังเข้าใจได้ สมองจะซึมซับคำศัพท์และรูปประโยคใหม่อย่างเป็นธรรมชาติ เป้าหมายคือความก้าวหน้าที่มั่นคง ไม่ใช่ความสมบูรณ์แบบ.\n\nวิธีใช้แบบฝึกหัดเล่มนี้:\nแต่ละบทเรียนช่วยกระตุ้นสิ่งที่คุณรู้อยู่แล้ว พาชมคำศัพท์ที่เป็นประโยชน์ และอ่านด้วยเป้าหมายที่ชัดเจน กิจกรรมต่อเนื่องตรวจสอบความเข้าใจ เสริมคำศัพท์ และชี้นำให้คุณแสดงความคิดเห็นของตนเองผ่านการเขียน.\n\nเชื่อมต่อกับแอป:\nแอป Reading Advantage สนับสนุนภารกิจของคุณด้วยการช่วยทบทวนคำศัพท์ ฝึกประโยค และติดตาม XP (experience points) ช่วงฝึกสั้น ๆ อย่างสม่ำเสมอจะช่วยให้คุณเลื่อนระดับเร็วขึ้นและจำสิ่งที่เรียนได้ยาวนาน.\n\nเมื่อจบ Quest คุณจะเข้าใจแนวคิดหลักของบทความสั้น ๆ ติดตามเรื่องเล่าง่าย ๆ ได้ และสื่อสารในสถานการณ์ประจำวันได้สบายขึ้น ความมั่นใจของคุณเพิ่มขึ้น และเส้นทางที่อยู่ข้างหน้ากำลังเปิดออก."
  },
  "B1": {
    "title": "Adventure - การผจญภัยอยู่ตรงหน้า",
    "text": "คุณไม่ได้แค่เรียนเพื่ออ่านอีกต่อไป คุณอ่านเพื่อค้นพบ.\n\nระดับ Adventure ออกแบบมาสำหรับผู้เรียนที่กำลังก้าวสู่การเป็นนักอ่านอิสระ บทความในเล่มนี้ยาว 500-600 คำ และสำรวจหัวข้ออย่างวิทยาศาสตร์ เทคโนโลยี เรื่องลึกลับ ชีวประวัติ และประเด็นระดับโลก คุณจะพบคำศัพท์ที่เข้มข้นขึ้น โครงสร้างประโยคซับซ้อนขึ้น และบทความที่ชวนให้คิดลึกกว่าที่เห็น.\n\nในช่วงนี้การอ่านอย่างกว้างขวางทรงพลังเป็นพิเศษ เมื่อคุณอ่านมากขึ้น คุณจะรับคำศัพท์และไวยากรณ์ใหม่ ๆ ได้เองผ่านการพบซ้ำ ๆ แต่ละบทความถูกเลือกมาเพื่อยืดความสามารถในขณะที่ยังคงความสนุกในการอ่าน.\n\nวิธีใช้แบบฝึกหัดเล่มนี้:\nบทเรียนชวนให้มีส่วนร่วมกับบทความอย่างลึกซึ้ง พยายามเดาความหมายจากบริบทก่อนเปิดพจนานุกรม สังเกตว่าความคิดเชื่อมโยงกันอย่างไรระหว่างย่อหน้า งานเขียนให้คุณอธิบายความคิดเห็น บรรยายประสบการณ์ และสนับสนุนแนวคิดด้วยเหตุผล.\n\nเชื่อมต่อกับแอป:\nแอปช่วยจัดการทักษะภาษาที่เติบโต ใช้ทบทวนคำศัพท์ ถามคำถามเกี่ยวกับรูปแบบภาษา และติดตามความก้าวหน้า การกลับไปอ่านบทความโปรดซ้ำ ๆ จะช่วยให้เข้าใจลึกขึ้น.\n\nเมื่อจบ Adventure คุณจะเข้าใจประเด็นสำคัญของบทความยาวขึ้น รับมือสถานการณ์คุ้นเคยได้อย่างมั่นใจ และถ่ายทอดความคิดได้ชัดเจน การผจญภัยเป็นจริงแล้ว และคุณพร้อมรับมัน."
  },
  "B2": {
    "title": "Hero - คุณคือฮีโร่ของเรื่อง",
    "text": "ในระดับนี้คุณก้าวสู่บทบาทผู้นำในการเรียนรู้ของตัวเอง.\n\nHero ถูกออกแบบมาสำหรับผู้อ่านระดับกลางตอนปลายที่พร้อมรับมือแนวคิดซับซ้อนและบทความในสไตล์ใกล้เคียงต้นฉบับ เนื้อหายาว 650-1000 คำ ครอบคลุมวิทยาศาสตร์ วัฒนธรรม สิ่งแวดล้อม เศรษฐศาสตร์ และการถกเถียงร่วมสมัย คุณจะพบความหมายแฝง การให้เหตุผล และคำศัพท์ที่มีนัยลึก.\n\nการอ่านอย่างกว้างขวางในระดับนี้เร่งการเติบโตอย่างเห็นได้ชัด เมื่อคุณอ่านอย่างต่อเนื่อง คำศัพท์ขยายรวดเร็วและความเข้าใจโครงสร้างกับสไตล์ก็ลึกซึ้งขึ้น.\n\nวิธีใช้แบบฝึกหัดเล่มนี้:\nเข้าแต่ละบทเรียนด้วยสายตาเชิงวิพากษ์ ถามว่าผู้เขียนเขียนเพื่ออะไร สนับสนุนความคิดด้วยอะไร และมุมมองใดถูกนำเสนอ งานเขียนต้องการการจัดโครงสร้างที่ชัดเจน ย่อหน้าที่พัฒนาเต็ม และคำตอบที่รอบคอบ.\n\nเชื่อมต่อกับแอป:\nใช้แอป Reading Advantage อย่างมีกลยุทธ์ โฟกัสคำศัพท์ที่มีมูลค่าสูง ใช้คำแนะนำจาก AI เพื่อปรับงานเขียน และท้าทายตัวเองให้สรุปหรืออธิบายบทความโดยไม่ย้อนกลับไปดู.\n\nเมื่อจบ Hero คุณจะเข้าใจบทความซับซ้อน โต้ตอบได้อย่างมั่นใจ และสื่อสารได้คล่องทั้งการพูดและการเขียน คุณไม่ได้ตามเรื่องอีกต่อไป คุณคือคนขับเรื่องราว."
  },
  "C1": {
    "title": "Legend - เข้าร่วมกลุ่มผู้เรียนระดับตำนาน",
    "text": "มีเพียงไม่กี่คนที่มาถึงขั้นนี้ ยินดีต้อนรับสู่ Legend.\n\nแบบฝึกเล่มนี้สร้างมาสำหรับผู้อ่านขั้นสูงที่พร้อมรับมือบทความท้าทายเหมือนงานเขียนสำหรับเจ้าของภาษาที่มีการศึกษา เนื้อหายาว 800-1200 คำ และสำรวจหัวข้อเชิงนามธรรม วิชาการ และเฉพาะทาง คุณจะพบความหมายละเอียด การให้เหตุผลระดับสูง และคำศัพท์ที่ซับซ้อน.\n\nในระดับนี้การอ่านอย่างกว้างขวางช่วยขัดเกลาสัญชาตญาณ คุณไม่ได้แค่เรียนคำใหม่ แต่กำลังพัฒนาความรู้สึกต่อโทน ระดับภาษา สไตล์ และนัยละเอียด.\n\nวิธีใช้แบบฝึกหัดเล่มนี้:\nมีส่วนร่วมกับบทความในฐานะผู้อ่านที่เท่าเทียม ประเมินข้อโต้แย้ง ตั้งคำถามต่อสมมติฐาน และเชื่อมโยงความคิดข้ามศาสตร์ งานเขียนต้องการคำตอบที่ยาว มีโครงสร้าง และใช้ถ้อยคำแม่นยำพร้อมเหตุผลที่ชัดเจน.\n\nเชื่อมต่อกับแอป:\nใช้แพลตฟอร์มให้เต็มที่ พูดคุยกับ AI เรื่องสไตล์ ปรับงานเขียนให้ประณีตขึ้น และจัดระเบียบคำศัพท์ตามธีมหรือระดับภาษา กลับไปอ่านบทความก่อน ๆ เพื่อดูว่ามุมมองของคุณพัฒนาอย่างไร.\n\nเมื่อจบ Legend คุณจะเข้าใจบทความซับซ้อนหลากหลาย และสื่อสารด้วยความแม่นยำและมั่นใจเพื่อเป้าหมายทางวิชาการ วิชาชีพ และปัญญา คุณจบการเดินทางแล้ว และคู่ควรกับการเป็นตำนาน."
  }
}
